app/controllers/citas_controller.rb

  def index
    @citas = Cita.all
---
SELECT * FROM "citas"

  def show
    @cita = Cita.find(params[:id])
---
SELECT * FROM "citas" WHERE ("citas"."id" = 1)

  def create
    @cita = Cita.new(params[:cita])

    respond_to do |format|
      if @cita.save
---
INSERT INTO "citas" ("fecha", "hora", "updated_at", "asunto", "user_id", "created_at") VALUES('2010-02-13', '2010-02-13 03:53:00', '2010-02-13 03:53:03', '', NULL, '2010-02-13 03:53:03')

  def destroy
    @cita = Cita.find(params[:id])
    @cita.destroy
---
SELECT * FROM "citas" WHERE ("citas"."id" = 1)
DELETE FROM "citas" WHERE "id" = 1