app/controllers/directorios_controller.rb

SELECT * FROM "directorios"
---
  def index
    @directorios = Directorio.all

SELECT * FROM "directorios" WHERE ("directorios"."id" = 0)
---
  def show
    @directorio = Directorio.find(params[:id])