app/controllers/session_controller.rb

  def create
    # Buscamos con este metodo mediante el login
    @user = User.find_by_login(params[:user][:login])
---
SELECT * FROM "users" WHERE ("users"."login" = '') LIMIT 1