app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("updated_at", "foto_file_size", "nombres", "fono", "mail", "foto_content_type", "foto_file_name", "login", "direccion", "pass", "apellidos", "created_at") VALUES('2010-02-13 23:45:25', NULL, 'hugo', '77529887', 'hugo_@gmail.com', NULL, NULL, 'hugo', 'av. rios', '123', 'limachi huanca', '2010-02-13 23:45:25')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "tipo" = 'admin', "updated_at" = '2010-02-14 01:00:58' WHERE "id" = 4